#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ssm_parameter.infra_output: Reading...
data.aws_iam_policy_document.assume_by_codedeploy: Reading...
data.aws_caller_identity.current: Reading...
aws_codedeploy_app.application_main: Refreshing state... [id=b326775b-2c4f-418c-afe6-c643eafbbc4b:app-6]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=app-6-task-execution-role]
data.aws_iam_policy_document.assume_by_codedeploy: Read complete after 0s [id=4250039221]
aws_iam_role.codedeploy: Refreshing state... [id=app-6-code-deploy-role]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_iam_role.ecs_task_role: Refreshing state... [id=app-6-task-role]
data.aws_ssm_parameter.infra_output: Read complete after 0s [id=/app-6/output]
aws_iam_policy.secrets_manager_read_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-6-ecs-fargate-secrets-manager-access]
aws_iam_role_policy_attachment.attach_secrets_read_task_role: Refreshing state... [id=app-6-task-role-20241003153209524100000003]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-6-task-execution-role-20241003153209502800000001]
aws_iam_role_policy_attachment.attach_secrets_read_task_execution_role: Refreshing state... [id=app-6-task-execution-role-20241003153209508300000002]
aws_ecs_task_definition.web_app: Refreshing state... [id=app-6]
data.aws_iam_policy_document.codedeploy: Reading...
data.aws_iam_policy_document.codedeploy: Read complete after 0s [id=1211725747]
aws_iam_role_policy.codedeploy: Refreshing state... [id=app-6-code-deploy-role:terraform-20241003165455650800000001]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:service/app-6/app-6]
aws_codedeploy_deployment_group.application_main: Refreshing state... [id=664c9ff4-b726-4afb-9654-85030ab22491]
local_file.code_deploy_sh: Refreshing state... [id=b652db79bb5ed1b961c0e59f40c10c4cb8b20919]
terraform_data.code_deploy: Refreshing state... [id=62194ac3-a843-0531-2cba-0a2ac488d768]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # local_file.code_deploy_sh has been deleted
  - resource "local_file" "code_deploy_sh" {
      - content              = <<-EOT
            #!/bin/bash
            echo "Starting CodeDeploy agent deployment"
            ID=$(aws deploy create-deployment \
                --application-name app-6 \
                --deployment-config-name CodeDeployDefault.OneAtATime \
                --deployment-group-name app-6-deploy-group \
                --appspec-content "$(cat appspec.json)" \
                --description "Deployment from Terraform" \
                --output json | jq -r '.deploymentId')
            
            echo "waiting for deployment to complete"
            STATUS=$(aws deploy get-deployment \
              --deployment-id "$ID" \
              --output json | jq -r '.deploymentInfo.status')
            
            while [ "$STATUS" == "Created" ] || [ "$STATUS" == "InProgress" ] || [ "$STATUS" == "Pending" ] || [ "$STATUS" == "Queued" ] || [ "$STATUS" == "Ready" ]; do
                echo "Deployment status: $STATUS"
                STATUS=$(aws deploy get-deployment \
                    --deployment-id "$ID" \
                    --output json | jq -r '.deploymentInfo.status')
                echo "waiting for 30 seconds."
                sleep 30
            done
            
            if [ "$STATUS" == "Succeeded" ]; then
                echo "Deployment $ID succeeded"
            else
                echo "Deployment $ID failed"
                exit 1
            fi
        EOT -> null
      - content_base64sha256 = "NoX6vPs4a8e8G/xVgCB2tQS0eV3WWU7RFuGma5/ReRA=" -> null
      - content_base64sha512 = "07hzPNuTQX7vFsnBNK4lzTRzvstCCPyOtItMPMlOEeIdsuxcgQ+ftIfBwpGphKNb8d3F7kmJCqW0R9Yd/hBs+w==" -> null
      - content_md5          = "91bf95115faf5244a45aee42cf7eb7ad" -> null
      - content_sha1         = "b652db79bb5ed1b961c0e59f40c10c4cb8b20919" -> null
      - content_sha256       = "3685fabcfb386bc7bc1bfc55802076b504b4795dd6594ed116e1a66b9fd17910" -> null
      - content_sha512       = "d3b8733cdb93417eef16c9c134ae25cd3473becb4208fc8eb48b4c3cc94e11e21db2ec5c810f9fb487c1c291a984a35bf1ddc5ee49890aa5b447d61dfe106cfb" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "./code_deploy.sh" -> null
      - id                   = "b652db79bb5ed1b961c0e59f40c10c4cb8b20919" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.web_app must be replaced
-/+ resource "aws_ecs_task_definition" "web_app" {
      ~ arn                      = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:34" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "app-6" -> (known after apply)
      ~ revision                 = 34 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # local_file.code_deploy_sh will be created
  + resource "local_file" "code_deploy_sh" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./code_deploy.sh"
      + id                   = (known after apply)
    }

  # terraform_data.code_deploy is tainted, so must be replaced
-/+ resource "terraform_data" "code_deploy" {
      ~ id               = "62194ac3-a843-0531-2cba-0a2ac488d768" -> (known after apply)
      ~ input            = "c1f3cbf8e055d2995a6bbede570c8a6161dbf3c6dec5973d5e6b98229a2c0e67" -> (known after apply)
      ~ output           = "c1f3cbf8e055d2995a6bbede570c8a6161dbf3c6dec5973d5e6b98229a2c0e67" -> (known after apply)
      ~ triggers_replace = {
          ~ content              = <<-EOT
                #!/bin/bash
                echo "Starting CodeDeploy agent deployment"
                ID=$(aws deploy create-deployment \
                    --application-name app-6 \
                    --deployment-config-name CodeDeployDefault.OneAtATime \
                    --deployment-group-name app-6-deploy-group \
                    --appspec-content "$(cat appspec.json)" \
                    --description "Deployment from Terraform" \
                    --output json | jq -r '.deploymentId')
                
                echo "waiting for deployment to complete"
                STATUS=$(aws deploy get-deployment \
                  --deployment-id "$ID" \
                  --output json | jq -r '.deploymentInfo.status')
                
                while [ "$STATUS" == "Created" ] || [ "$STATUS" == "InProgress" ] || [ "$STATUS" == "Pending" ] || [ "$STATUS" == "Queued" ] || [ "$STATUS" == "Ready" ]; do
                    echo "Deployment status: $STATUS"
                    STATUS=$(aws deploy get-deployment \
                        --deployment-id "$ID" \
                        --output json | jq -r '.deploymentInfo.status')
                    echo "waiting for 30 seconds."
                    sleep 30
                done
                
                if [ "$STATUS" == "Succeeded" ]; then
                    echo "Deployment $ID succeeded"
                else
                    echo "Deployment $ID failed"
                    exit 1
                fi
            EOT -> (known after apply)
          ~ content_base64sha256 = "NoX6vPs4a8e8G/xVgCB2tQS0eV3WWU7RFuGma5/ReRA=" -> (known after apply)
          ~ content_base64sha512 = "07hzPNuTQX7vFsnBNK4lzTRzvstCCPyOtItMPMlOEeIdsuxcgQ+ftIfBwpGphKNb8d3F7kmJCqW0R9Yd/hBs+w==" -> (known after apply)
          ~ content_md5          = "91bf95115faf5244a45aee42cf7eb7ad" -> (known after apply)
          ~ content_sha1         = "b652db79bb5ed1b961c0e59f40c10c4cb8b20919" -> (known after apply)
          ~ content_sha256       = "3685fabcfb386bc7bc1bfc55802076b504b4795dd6594ed116e1a66b9fd17910" -> (known after apply)
          ~ content_sha512       = "d3b8733cdb93417eef16c9c134ae25cd3473becb4208fc8eb48b4c3cc94e11e21db2ec5c810f9fb487c1c291a984a35bf1ddc5ee49890aa5b447d61dfe106cfb" -> (known after apply)
          ~ id                   = "b652db79bb5ed1b961c0e59f40c10c4cb8b20919" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*